; domain
(define (domain dungeon)

;;(:requirements :strips :typing :conditional-effects :negative-preconditions :equality)

(:types
    hero
    sword
    monster
    trap
    room
)

(:predicates

    (hero-in-room ?h - hero ?r - room) ; is the hero in room ?
    (hero-empty-handed ?h - hero) ; is the hero empty-handed ? i.e. does he not have a sword ?
    (hero-alive ?h - hero) ; is the hero alive ?

    (sword-in-room ?s - sword ?r - room) ; is there a sword in room ?
    (sword-destroyed ?s - sword) ; has the sword been destroyed ?
    (sword-holding ?h - hero ?x - sword) ; is the hero holding the sword ?

    (monster-in-room ?m - monster ?r - room) ; is there a monster in room ?
    (monster-afraid ?h - hero ?m - monster) ; is monster afraid of hero ? (yes if hero holds a sword)

    (trap-in-room ?t - trap ?r - room) ; is there a trap in the room ?
    (trap-armed ?t - trap ?r - room) ; is the trap armed ?
    (trap-disarmed ?t - trap ?r - room) ; is the trap disarmed ?

    (room-destroyed ?r - room) ; is the room destroyed ?
    (room-cleared ?h - hero ?r - room) ; has the room being cleared ? (i.e. no monsters, all traps disarmed)
    (room-corridor ?c ?r - room) ; is there a corridor to an adjacent room ?

)

;; Hero actions

(:action move
    :parameters (?h - hero ?from - room ?to - room)
    :precondition (and
        (not (room-destroyed ?to)) 
        (hero-in-room ?h ?from)
        (hero-alive ?h)
        (room-corridor ?from ?to)
        (room-cleared ?h ?from)
    )
    :effect (and 
        (hero-alive ?h)
        (hero-in-room ?h ?to)
        (not (hero-in-room ?h ?from))
        (room-destroyed ?from)
    )
)

(:action pickup-sword
    :parameters (?r - room ?h - hero ?s - sword)
    :precondition (and
        (hero-alive ?h)
        (hero-in-room ?h ?r)
        (hero-empty-handed ?h)
        (sword-in-room ?s ?r)
        (not ( sword-holding ?h ?s))
    )
    :effect (and
        (hero-alive ?h)
        (hero-in-room ?h ?r)
        (not (hero-empty-handed ?h))
        (not ( sword-in-room ?s ?r ))
        (not ( sword-destroyed ?s ))
        (sword-holding ?h ?s)
        (room-cleared ?h ?r)
    )
)

(:action destroy-sword
    :parameters (?h - hero ?s - sword)
    :precondition (and
        (hero-alive ?h)
        (sword-holding ?h ?s)
    )
    :effect (and
        (hero-alive ?h)
        (sword-destroyed ?s)
        (hero-empty-handed ?h )
    )
)

(:action disarm-trap
    :parameters (?h - hero ?r - room ?t - trap)
    :precondition (and
        (hero-alive ?h)
        (hero-in-room ?h ?r)
        (hero-empty-handed ?h)
        (trap-in-room ?t ?r)
        (trap-armed ?t ?r)
        (not (trap-disarmed ?t ?r))
    )
    :effect (and
        (hero-alive ?h)
        (hero-in-room ?h ?r)
        (hero-empty-handed ?h)
        (trap-in-room ?t ?r)
        (not (trap-armed ?t ?r))
        (trap-disarmed ?t ?r)
        (room-cleared ?h ?r)
    )
)

(:action face-monster
    :parameters (?h - hero ?s - sword ?r - room ?m - monster)
    :precondition (and
        (hero-alive ?h)
        (hero-in-room ?h ?r)
        (sword-holding ?h ?s)
        (monster-in-room ?m ?r)
        (not (monster-afraid ?h ?m))
    )
    :effect (and
        (hero-alive ?h)
        (hero-in-room ?h ?r)
        (sword-holding ?h ?s)
        (monster-in-room ?m ?r)
        (monster-afraid ?h ?m)
        (room-cleared ?h ?r)
    )
)

)

; problem
(define (problem pb1) (:domain dungeon)
(:objects
    player - hero
    m0 m1 m2 m3 m4 m5 m6 - monster
    t0 t1 t2 t3 t4 t5 - trap
    s0 s1 s2 s3 - sword
    r0 r1 r2 r3 r4 r5 r6 r7 r8 r9 r10 r11 r12 r13 r14 r15 r16 r17 r18 r19 - room
)

(:init
    (hero-alive player)
    (hero-in-room player r0)
    (hero-empty-handed player)
    
    (monster-in-room m0 r2)
    (not (monster-afraid player m0))
    (monster-in-room m1 r2)
    (not (monster-afraid player m1))
    (monster-in-room m2 r9)
    (not (monster-afraid player m2))
    (monster-in-room m3 r10)
    (not (monster-afraid player m3))
    (monster-in-room m4 r12)
    (not (monster-afraid player m4))
    (monster-in-room m5 r14)
    (not (monster-afraid player m5))
    (monster-in-room m6 r15)
    (not (monster-afraid player m6))

    (trap-in-room t0 r3)
    (trap-armed t0 r3)
    (not (trap-disarmed t0 r3))
    (trap-in-room t1 r7)
    (trap-armed t1 r7)
    (not (trap-disarmed t1 r7))
    (trap-in-room t2 r8)
    (trap-armed t2 r8)
    (not (trap-disarmed t2 r8))
    (trap-in-room t3 r13)
    (trap-armed t3 r13)
    (not (trap-disarmed t3 r13))
    (trap-in-room t4 r17)
    (trap-armed t4 r17)
    (not (trap-disarmed t4 r17))
    (trap-in-room t5 r18)
    (trap-armed t5 r18)
    (not (trap-disarmed t5 r18))

    (sword-in-room s0 r5)
    (not (sword-destroyed s0))
    (not (sword-holding player s0))
    (sword-in-room s0 r6)
    (not (sword-destroyed s0))
    (not (sword-holding player s0))
    (sword-in-room s0 r11)
    (not (sword-destroyed s0))
    (not (sword-holding player s0))
    (sword-in-room s0 r16)
    (not (sword-destroyed s0))
    (not (sword-holding player s0))

    (not (room-destroyed r0))
    (not (room-destroyed r1))
    (not (room-destroyed r2))
    (not (room-destroyed r3))
    (not (room-destroyed r4))
    (not (room-destroyed r5))
    (not (room-destroyed r6))
    (not (room-destroyed r7))
    (not (room-destroyed r8))
    (not (room-destroyed r9))
    (not (room-destroyed r10))
    (not (room-destroyed r11))
    (not (room-destroyed r12))
    (not (room-destroyed r13))
    (not (room-destroyed r14))
    (not (room-destroyed r15))
    (not (room-destroyed r16))
    (not (room-destroyed r17))
    (not (room-destroyed r18))
    (not (room-destroyed r19))

    (room-cleared player r0)
    (room-cleared player r1)

    (room-corridor r0 r1)
    (room-corridor r0 r2)
    (room-corridor r1 r0)
    (room-corridor r1 r3)
    (room-corridor r1 r4)
    (room-corridor r2 r0)
    (room-corridor r2 r4)
    (room-corridor r2 r5)
    (room-corridor r3 r1)
    (room-corridor r3 r6)
    (room-corridor r3 r7)
    (room-corridor r4 r1)
    (room-corridor r4 r6)
    (room-corridor r4 r7)
    (room-corridor r4 r8)
    (room-corridor r5 r2)
    (room-corridor r5 r9)
    (room-corridor r5 r8)
    (room-corridor r6 r3)
    (room-corridor r6 r10)
    (room-corridor r7 r3)
    (room-corridor r7 r4)
    (room-corridor r7 r10)
    (room-corridor r7 r11)
    (room-corridor r8 r4)
    (room-corridor r8 r5)
    (room-corridor r8 r11)
    (room-corridor r8 r12)
    (room-corridor r9 r5)
    (room-corridor r9 r13)
    (room-corridor r9 r12)
    (room-corridor r10 r6)
    (room-corridor r10 r7)
    (room-corridor r10 r14)
    (room-corridor r11 r7)
    (room-corridor r11 r8)
    (room-corridor r11 r14)
    (room-corridor r11 r15)
    (room-corridor r12 r9)
    (room-corridor r12 r8)
    (room-corridor r12 r16)
    (room-corridor r12 r15)
    (room-corridor r13 r9)
    (room-corridor r13 r16)
    (room-corridor r14 r10)
    (room-corridor r14 r11)
    (room-corridor r14 r17)
    (room-corridor r15 r12)
    (room-corridor r15 r11)
    (room-corridor r15 r17)
    (room-corridor r15 r18)
    (room-corridor r16 r12)
    (room-corridor r16 r13)
    (room-corridor r16 r18)
    (room-corridor r17 r14)
    (room-corridor r17 r15)
    (room-corridor r17 r19)
    (room-corridor r18 r16)
    (room-corridor r18 r15)
    (room-corridor r18 r19)
    (room-corridor r19 r18)
    (room-corridor r19 r17)

)
(:goal (and (hero-in-room player r19) (hero-alive player)))
)

; plan
1. (move player r0 r1)
   deleted: (hero-in-room player r0)
   added: (hero-in-room player r1) (room-destroyed r0)
   goals met: 1 of 2
2. (move player r1 r3)
   deleted: (hero-in-room player r1)
   added: (hero-in-room player r3) (room-destroyed r1)
   goals met: 1 of 2
3. (disarm-trap player r3 t0)
   deleted: (trap-armed t0 r3)
   added: (trap-disarmed t0 r3) (room-cleared player r3)
   goals met: 1 of 2
4. (move player r3 r7)
   deleted: (hero-in-room player r3)
   added: (hero-in-room player r7) (room-destroyed r3)
   goals met: 1 of 2
5. (disarm-trap player r7 t1)
   deleted: (trap-armed t1 r7)
   added: (trap-disarmed t1 r7) (room-cleared player r7)
   goals met: 1 of 2
6. (move player r7 r11)
   deleted: (hero-in-room player r7)
   added: (hero-in-room player r11) (room-destroyed r7)
   goals met: 1 of 2
7. (pickup-sword r11 player s0)
   deleted: (hero-empty-handed player) (sword-in-room s0 r11)
   added: (sword-holding player s0) (room-cleared player r11)
   goals met: 1 of 2
8. (destroy-sword player s0)
   added: (sword-destroyed s0) (hero-empty-handed player)
   goals met: 1 of 2
9. (move player r11 r14)
   deleted: (hero-in-room player r11)
   added: (hero-in-room player r14) (room-destroyed r11)
   goals met: 1 of 2
10. (face-monster player s0 r14 m5)
   added: (monster-afraid player m5) (room-cleared player r14)
   goals met: 1 of 2
11. (move player r14 r17)
   deleted: (hero-in-room player r14)
   added: (hero-in-room player r17) (room-destroyed r14)
   goals met: 1 of 2
12. (disarm-trap player r17 t4)
   deleted: (trap-armed t4 r17)
   added: (trap-disarmed t4 r17) (room-cleared player r17)
   goals met: 1 of 2
13. (move player r17 r19)
   deleted: (hero-in-room player r17)
   added: (hero-in-room player r19) (room-destroyed r17)
   goals met: 2 of 2
